Обработки/Reports/_ОтчетностьСбербанка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОтчетностьСбербанка</Name>
			<Comment>Ранее "Сбербанк и Электроэнергетика"</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОтчетностьСбербанка/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Отчетность сбербанка",
		"2.10",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	// Фиксируем запуск процедуры
	Механизм			= ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	ПараметрыВыполнения = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполнения.Хранилище, ПараметрыВыполнения.Описание);
		
	// Формируем отчет		
	#Область Текст_запроса	
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	СчетаДоверительногоУправления.КодСчета КАК КодСчета,
		|	СчетаДоверительногоУправления.Организация КАК Организация,
		|	СчетаДоверительногоУправления.Организация.ЮрФизЛицо КАК ЮрЛицоОрганизации,
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
		|ПОМЕСТИТЬ _Клиент
		|ИЗ
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&ДатаФормирования, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ПО (КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка)
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Клиент.КодСчета КАК КодСчета,
		|	_Клиент.НомерДоговора КАК НомерДоговора,
		|	_Клиент.ДатаЗаключения КАК ДатаЗаключения,
		|	ЕСТЬNULL(РеквизитыКлиентаЮрЛица.ПолноеНаименованиеПоУставу, ЕСТЬNULL(РеквизитыКлиентаФизЛица.Фамилия + "" "" + РеквизитыКлиентаФизЛица.Имя + "" "" + РеквизитыКлиентаФизЛица.Отчество, _Клиент.Клиент)) КАК Клиент,
		|	ЕСТЬNULL(РеквизитыОрганизации.КраткоеНаименованиеПоУставу, _Клиент.Организация) КАК Организация
		|ИЗ
		|	_Клиент КАК _Клиент
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаФормирования,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						_Клиент.Организация,
		|						_Клиент.Клиент,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_Клиент)) КАК РеквизитыКлиентаЮрЛица
		|		ПО (РеквизитыКлиентаЮрЛица.ЮрФизЛицо = _Клиент.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
		|				&ДатаФормирования,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						_Клиент.Организация,
		|						_Клиент.Клиент,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_Клиент)) КАК РеквизитыКлиентаФизЛица
		|		ПО (РеквизитыКлиентаФизЛица.ЮрФизЛицо = _Клиент.Клиент)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&ДатаФормирования,
		|				(Организация, ЮрФизЛицо, Язык) В
		|					(ВЫБРАТЬ
		|						_Клиент.Организация,
		|						_Клиент.ЮрЛицоОрганизации,
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					ИЗ
		|						_Клиент)) КАК РеквизитыОрганизации
		|		ПО (РеквизитыОрганизации.ЮрФизЛицо = _Клиент.ЮрЛицоОрганизации)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Порядок,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ""Р/сч ДУ""
		|		ИНАЧЕ ""На счете брокера""
		|	КОНЕЦ КАК Строка,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредствОстатки.РасчетныйСчет.НомерСчета
		|		ИНАЧЕ ОстаткиДенежныхСредствОстатки.Брокер
		|	КОНЕЦ КАК РасшифровкаСтроки,
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредствОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Остаток,
		|	0 КАК КредиторскаяЗадолженность,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ОстаткиДенежныхСредствОстатки.СуммаОстаток
		|	КОНЕЦ КАК ДебиторскаяЗадолженность
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредствНаНачало
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПогашениеКупона
		|				ИЛИ ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.Облигация.Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&НачалоПериода,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиДенежныхСредствНаНачало.Порядок КАК Порядок,
		|	_ОстаткиДенежныхСредствНаНачало.Строка КАК Строка,
		|	_ОстаткиДенежныхСредствНаНачало.РасшифровкаСтроки КАК РасшифровкаСтроки,
		|	СУММА(_ОстаткиДенежныхСредствНаНачало.Остаток * КурсыВалют.Курс / КурсыВалют.Кратность) КАК Остаток,
		|	СУММА(_ОстаткиДенежныхСредствНаНачало.КредиторскаяЗадолженность * КурсыВалют.Курс / КурсыВалют.Кратность) КАК КредиторскаяЗадолженность,
		|	СУММА(_ОстаткиДенежныхСредствНаНачало.ДебиторскаяЗадолженность * КурсыВалют.Курс / КурсыВалют.Кратность) КАК ДебиторскаяЗадолженность
		|ИЗ
		|	_ОстаткиДенежныхСредствНаНачало КАК _ОстаткиДенежныхСредствНаНачало
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = _ОстаткиДенежныхСредствНаНачало.Валюта)
		|			И (КурсыВалют.Период = &НачалоПериода)
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиДенежныхСредствНаНачало.Порядок,
		|	_ОстаткиДенежныхСредствНаНачало.Строка,
		|	_ОстаткиДенежныхСредствНаНачало.РасшифровкаСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОстаткиДенежныхСредствНаНачало.Порядок
		|ИТОГИ
		|	СУММА(Остаток),
		|	СУММА(КредиторскаяЗадолженность),
		|	СУММА(ДебиторскаяЗадолженность)
		|ПО
		|	ОБЩИЕ,
		|	Строка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА 1
		|		ИНАЧЕ 2
		|	КОНЕЦ КАК Порядок,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ""Р/сч ДУ""
		|		ИНАЧЕ ""На счете брокера""
		|	КОНЕЦ КАК Строка,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредствОстатки.РасчетныйСчет.НомерСчета
		|		ИНАЧЕ ОстаткиДенежныхСредствОстатки.Брокер
		|	КОНЕЦ КАК РасшифровкаСтроки,
		|	ОстаткиДенежныхСредствОстатки.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредствОстатки.СуммаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Остаток,
		|	0 КАК КредиторскаяЗадолженность,
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОстатки.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА 0
		|		ИНАЧЕ ОстаткиДенежныхСредствОстатки.СуммаОстаток
		|	КОНЕЦ КАК ДебиторскаяЗадолженность
		|ПОМЕСТИТЬ _ОстаткиДенежныхСредствНаКонец
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Остатки(
		|			&КонецПериодаГраница,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	3,
		|	ЗадолженностиПоДенежнымСредствамОстатки.ВидЗадолженности,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПогашениеКупона
		|				ИЛИ ЗадолженностиПоДенежнымСредствамОстатки.Основание ССЫЛКА Документ.ПогашениеЦеннойБумаги
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.Основание.Облигация.Эмитент
		|		ИНАЧЕ """"
		|	КОНЕЦ,
		|	ЗадолженностиПоДенежнымСредствамОстатки.Валюта,
		|	0,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ЗадолженностиПоДенежнымСредствамОстатки.ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Дебиторская)
		|			ТОГДА ЗадолженностиПоДенежнымСредствамОстатки.СуммаОстаток + ЗадолженностиПоДенежнымСредствамОстатки.СуммаКупонаОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Остатки(
		|			&КонецПериодаГраница,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЗадолженностиПоДенежнымСредствамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ОстаткиДенежныхСредствНаКонец.Порядок КАК Порядок,
		|	_ОстаткиДенежныхСредствНаКонец.Строка КАК Строка,
		|	_ОстаткиДенежныхСредствНаКонец.РасшифровкаСтроки КАК РасшифровкаСтроки,
		|	СУММА(_ОстаткиДенежныхСредствНаКонец.Остаток * КурсыВалют.Курс / КурсыВалют.Кратность) КАК Остаток,
		|	СУММА(_ОстаткиДенежныхСредствНаКонец.КредиторскаяЗадолженность * КурсыВалют.Курс / КурсыВалют.Кратность) КАК КредиторскаяЗадолженность,
		|	СУММА(_ОстаткиДенежныхСредствНаКонец.ДебиторскаяЗадолженность * КурсыВалют.Курс / КурсыВалют.Кратность) КАК ДебиторскаяЗадолженность
		|ИЗ
		|	_ОстаткиДенежныхСредствНаКонец КАК _ОстаткиДенежныхСредствНаКонец
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют КАК КурсыВалют
		|		ПО (КурсыВалют.Валюта = _ОстаткиДенежныхСредствНаКонец.Валюта)
		|			И (КурсыВалют.Период = НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ))
		|
		|СГРУППИРОВАТЬ ПО
		|	_ОстаткиДенежныхСредствНаКонец.Порядок,
		|	_ОстаткиДенежныхСредствНаКонец.Строка,
		|	_ОстаткиДенежныхСредствНаКонец.РасшифровкаСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	_ОстаткиДенежныхСредствНаКонец.Порядок
		|ИТОГИ
		|	СУММА(Остаток),
		|	СУММА(КредиторскаяЗадолженность),
		|	СУММА(ДебиторскаяЗадолженность)
		|ПО
		|	ОБЩИЕ,
		|	Строка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.Рынок КАК Рынок,
		|	ОперацииСЦеннымиБумагами.ДатаОперации КАК ДатаОперации,
		|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор,
		|	ОперацииСЦеннымиБумагами.Основание КАК Основание,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.Валюта КАК Валюта,
		|	ОперацииСЦеннымиБумагами.ВидДвижения КАК ВидДвижения,
		|	ОперацииСЦеннымиБумагами.Количество КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ОперацииСЦеннымиБумагами.Сумма КАК Сумма,
		|	ОперацииСЦеннымиБумагами.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _ОперацииЗаПериод
		|ИЗ
		|	РегистрСведений.ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|ГДЕ
		|	ОперацииСЦеннымиБумагами.ДатаОперации МЕЖДУ &НачалоПериода И &КонецПериода
		|	И ОперацииСЦеннымиБумагами.Организация = &Организация
		|	И ОперацииСЦеннымиБумагами.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Операции.Рынок КАК Рынок,
		|	_Операции.ДатаОперации КАК ДатаОперации,
		|	_Операции.ДатаОперации КАК ДатаПринятияКУчетуЦБ,
		|	ЕСТЬNULL(_Оплаты.ДатаОперации, _Операции.ДатаОперации) КАК ДатаПлатежа,
		|	_Операции.Регистратор КАК Регистратор,
		|	_Операции.Основание КАК Основание,
		|	_Операции.ЦеннаяБумага КАК ЦеннаяБумага,
		|	_Операции.Валюта КАК Валюта,
		|	_Операции.ВидДвижения КАК ВидДвижения,
		|	_Операции.Количество КАК Количество,
		|	_Операции.Цена КАК Цена,
		|	_Операции.Сумма КАК Сумма,
		|	_Операции.СуммаКупона КАК СуммаКупона,
		|	_Оплаты.Сумма КАК СуммаОплата,
		|	_Оплаты.СуммаКупона КАК СуммаКупонаОплата
		|ПОМЕСТИТЬ _ОперацииСЦеннымиБумагами
		|ИЗ
		|	_ОперацииЗаПериод КАК _Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОперацииЗаПериод КАК _Оплаты
		|		ПО (_Оплаты.Основание = _Операции.Регистратор)
		|			И (ТИПЗНАЧЕНИЯ(_Оплаты.Регистратор) = ТИП(Документ.Оплата))
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Операции.Регистратор) <> ТИП(Документ.Оплата)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	_Оплаты.Рынок,
		|	_Оплаты.Основание.Дата,
		|	_Оплаты.Основание.Дата,
		|	_Оплаты.ДатаОперации,
		|	_Оплаты.Регистратор,
		|	_Оплаты.Основание,
		|	_Оплаты.ЦеннаяБумага,
		|	_Оплаты.Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Расход),
		|	_Оплаты.Количество,
		|	_Оплаты.Цена,
		|	_Оплаты.Сумма,
		|	_Оплаты.СуммаКупона,
		|	_Оплаты.Сумма,
		|	_Оплаты.СуммаКупона
		|ИЗ
		|	_ОперацииЗаПериод КАК _Оплаты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|		ПО (Оплата.Ссылка = _Оплаты.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОперацииЗаПериод КАК _Операции
		|		ПО _Оплаты.Основание = _Операции.Регистратор
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(_Оплаты.Регистратор) = ТИП(Документ.Оплата)
		|	И _Операции.Основание ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОперацииСЦеннымиБумагами.Регистратор КАК Регистратор,
		|	ОперацииСЦеннымиБумагами.Рынок КАК Рынок,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ПоставкаЦенныхБумаг.Основание.Дата
		|		КОГДА ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ТОГДА ИсполнениеОбязательствПоСделке.Основание.Дата
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.ДатаОперации
		|	КОНЕЦ КАК ДатаДоговора,
		|	ОперацииСЦеннымиБумагами.ДатаПринятияКУчетуЦБ КАК ДатаПринятияКУчетуЦБ,
		|	ОперацииСЦеннымиБумагами.ДатаПлатежа КАК ДатаПлатежа,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВводЦенныхБумаг)
		|			ТОГДА ""Ввод цб""
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ВыводЦенныхБумаг)
		|			ТОГДА ""Вывод цб""
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИзменениеУсловийСделки)
		|			ТОГДА ИзменениеУсловийСделки.Основание.ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ИсполнениеОбязательствПоСделке)
		|			ТОГДА ИсполнениеОбязательствПоСделке.ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.НачислениеДивидендов)
		|			ТОГДА ""Дивиденды""
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Оплата)
		|			ТОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Основание)
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ""Погашение купона""
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПогашениеЦеннойБумаги)
		|			ТОГДА ""Погашение облигации""
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.ПоставкаЦенныхБумаг)
		|			ТОГДА ПоставкаЦенныхБумаг.Основание.ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Сделка)
		|			ТОГДА Сделка.ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СделкаРЕПО)
		|			ТОГДА СделкаРЕПО.ВидСделки
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.СписаниеЦеннойБумаги)
		|			ТОГДА ""Списание облигации""
		|		ИНАЧЕ ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор)
		|	КОНЕЦ КАК СодержаниеОперации,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага КАК ЦеннаяБумага,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага.Эмитент КАК ЦеннаяБумагаЭмитент,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага.Эмитент.ЮрФизЛицо КАК ЦеннаяБумагаЭмитентЮрФизЛицо,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага.ГосударственныйРегистрационныйНомер КАК ЦеннаяБумагаГосударственныйРегистрационныйНомер,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага.ДатаПогашения КАК ЦеннаяБумагаДатаПогашения,
		|	ОперацииСЦеннымиБумагами.ЦеннаяБумага.ДатаРегистрации КАК ЦеннаяБумагаДатаРегистрации,
		|	ОперацииСЦеннымиБумагами.ВидДвижения КАК ВидДвижения,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.Количество = 0
		|				И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) = ТИП(Документ.Оплата)
		|				И ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Основание) = ТИП(Документ.ПогашениеКупона)
		|			ТОГДА ВЫРАЗИТЬ(ОперацииСЦеннымиБумагами.Основание КАК Документ.ПогашениеКупона).Количество
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Количество
		|	КОНЕЦ КАК Количество,
		|	ОперацииСЦеннымиБумагами.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА 0
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|			ТОГДА ОперацииСЦеннымиБумагами.СуммаОплата
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА 0
		|		КОГДА ТИПЗНАЧЕНИЯ(ОперацииСЦеннымиБумагами.Регистратор) В (ТИП(Документ.ПогашениеКупона), ТИП(Документ.ПогашениеЦеннойБумаги))
		|			ТОГДА ОперацииСЦеннымиБумагами.СуммаКупонаОплата
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.СуммаКупона
		|	КОНЕЦ КАК СуммаКупона,
		|	ВЫБОР
		|		КОГДА ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ПоставкаЦенныхБумаг
		|			ТОГДА ПоставкаЦенныхБумаг.Основание
		|		КОГДА ОперацииСЦеннымиБумагами.Регистратор ССЫЛКА Документ.ИсполнениеОбязательствПоСделке
		|			ТОГДА ИсполнениеОбязательствПоСделке.Основание
		|		КОГДА Сделка.ОтложенноеИсполнение
		|			ТОГДА NULL
		|		ИНАЧЕ ОперацииСЦеннымиБумагами.Регистратор
		|	КОНЕЦ КАК ОснованиеКомиссии,
		|	ОперацииСЦеннымиБумагами.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Операции
		|ИЗ
		|	_ОперацииСЦеннымиБумагами КАК ОперацииСЦеннымиБумагами
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоставкаЦенныхБумаг КАК ПоставкаЦенныхБумаг
		|		ПО (ПоставкаЦенныхБумаг.Ссылка = ОперацииСЦеннымиБумагами.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИсполнениеОбязательствПоСделке КАК ИсполнениеОбязательствПоСделке
		|		ПО (ИсполнениеОбязательствПоСделке.Ссылка = ОперацииСЦеннымиБумагами.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Сделка КАК Сделка
		|		ПО (Сделка.Ссылка = ОперацииСЦеннымиБумагами.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СделкаРЕПО КАК СделкаРЕПО
		|		ПО (СделкаРЕПО.Ссылка = ОперацииСЦеннымиБумагами.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИзменениеУсловийСделки КАК ИзменениеУсловийСделки
		|		ПО (ИзменениеУсловийСделки.Ссылка = ОперацииСЦеннымиБумагами.Регистратор)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание КАК Основание,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта КАК Валюта,
		|	СУММА(ЗадолженностиПоДенежнымСредствамОбороты.СуммаРасход) КАК Сумма
		|ПОМЕСТИТЬ _Комиссии
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Период,
		|			СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Организация = &Организация
		|				И Основание В
		|					(ВЫБРАТЬ
		|						_Операции.ОснованиеКомиссии
		|					ИЗ
		|						_Операции)
		|				И ТипЗадолженности = ЗНАЧЕНИЕ(Перечисление.ТипыЗадолженности.Кредиторская)
		|				И ВидЗадолженности В (ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоТорговойКомиссии), ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоБрокерскойКомиссии))) КАК ЗадолженностиПоДенежнымСредствамОбороты
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствамОбороты.Основание,
		|	ЗадолженностиПоДенежнымСредствамОбороты.Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _Операции.Рынок = ЗНАЧЕНИЕ(Перечисление.РынкиЦенныхБумаг.Облигации)
		|			ТОГДА ВЫБОР
		|					КОГДА Облигации.Категория В (ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Государственная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Субфедеральная), ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Муниципальная))
		|							ИЛИ Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|								И РеквизитыЭмитента.ОрганизационноПравоваяФорма = ЗНАЧЕНИЕ(Справочник.ОрганизационноПравовыеФормы.ГосударственнаяКорпорация)
		|						ТОГДА ""Облигации (гос. и муницип.)""
		|					КОГДА Облигации.Категория = ЗНАЧЕНИЕ(Перечисление.КатегорииОблигаций.Корпоративная)
		|						ТОГДА ""Облигации (корп.)""
		|					ИНАЧЕ ""Облигации (прочие)""
		|				КОНЕЦ
		|		ИНАЧЕ _Операции.Рынок
		|	КОНЕЦ КАК ВидЦБ,
		|	_Операции.ДатаДоговора КАК ДатаДоговора,
		|	_Операции.ДатаПринятияКУчетуЦБ КАК ДатаПринятияКУчетуЦБ,
		|	_Операции.ДатаПлатежа КАК ДатаПлатежа,
		|	_Операции.СодержаниеОперации КАК СодержаниеОперации,
		|	ЕСТЬNULL(РеквизитыЭмитента.КраткоеНаименованиеПоУставу, ЕСТЬNULL(_Операции.ЦеннаяБумагаЭмитент, _Операции.ЦеннаяБумага)) КАК ЦеннаяБумага,
		|	_Операции.ЦеннаяБумагаГосударственныйРегистрационныйНомер КАК ЦеннаяБумагаГосударственныйРегистрационныйНомер,
		|	ЕСТЬNULL(_Операции.ЦеннаяБумагаДатаПогашения, ДАТАВРЕМЯ(1, 1, 1)) КАК ЦеннаяБумагаДатаПогашения,
		|	_Операции.ЦеннаяБумагаДатаРегистрации КАК ЦеннаяБумагаДатаРегистрации,
		|	_Операции.Количество КАК Количество,
		|	_Операции.Цена КАК Цена,
		|	ВЫБОР
		|		КОГДА _Операции.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -_Операции.Сумма
		|		ИНАЧЕ _Операции.Сумма
		|	КОНЕЦ КАК Сумма,
		|	ВЫБОР
		|		КОГДА _Операции.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -_Операции.СуммаКупона
		|		ИНАЧЕ _Операции.СуммаКупона
		|	КОНЕЦ КАК СуммаКупона,
		|	ВЫБОР
		|		КОГДА _Операции.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -_Операции.Сумма - _Операции.СуммаКупона
		|		ИНАЧЕ _Операции.Сумма + _Операции.СуммаКупона
		|	КОНЕЦ КАК Всего,
		|	ЕСТЬNULL(-_Комиссии.Сумма, 0) КАК СуммаКомиссии,
		|	ВЫБОР
		|		КОГДА _Операции.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидыДвижений.Приход)
		|			ТОГДА -_Операции.Сумма - _Операции.СуммаКупона - ЕСТЬNULL(_Комиссии.Сумма, 0)
		|		ИНАЧЕ _Операции.Сумма + _Операции.СуммаКупона - ЕСТЬNULL(_Комиссии.Сумма, 0)
		|	КОНЕЦ КАК СуммаПлатежа
		|ИЗ
		|	_Операции КАК _Операции
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Комиссии КАК _Комиссии
		|		ПО (_Комиссии.Основание = _Операции.ОснованиеКомиссии)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
		|		ПО (Облигации.Ссылка = _Операции.ЦеннаяБумага)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаФормирования,
		|				(Подразделение, Язык, ЮрФизЛицо) В
		|					(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|						ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний),
		|						ЗНАЧЕНИЕ(Справочник.Языки.Русский),
		|						_Операции.ЦеннаяБумагаЭмитентЮрФизЛицо
		|					ИЗ
		|						_Операции)) КАК РеквизитыЭмитента
		|		ПО (РеквизитыЭмитента.ЮрФизЛицо = _Операции.ЦеннаяБумагаЭмитентЮрФизЛицо)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВидЦБ,
		|	ДатаДоговора
		|ИТОГИ
		|	СУММА(Сумма),
		|	СУММА(СуммаКупона),
		|	СУММА(Всего),
		|	СУММА(СуммаКомиссии),
		|	СУММА(СуммаПлатежа)
		|ПО
		|	ВидЦБ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА ОстаткиДенежныхСредствОбороты.Брокер = ЗНАЧЕНИЕ(Справочник.БрокерскиеКомпании.ПустаяСсылка)
		|			ТОГДА ОстаткиДенежныхСредствОбороты.РасчетныйСчет.НомерСчета
		|		ИНАЧЕ КодБрокера.ДоговорБрокерскогоОбслуживания
		|	КОНЕЦ КАК БанковскийСчет,
		|	ОстаткиДенежныхСредствОбороты.Период КАК ДатаПлатежа,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредствОбороты.Регистратор) = ТИП(Документ.Оплата)
		|			ТОГДА Оплата.ВидЗадолженности
		|		ИНАЧЕ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредствОбороты.Регистратор)
		|	КОНЕЦ КАК СодержаниеОперации,
		|	ОстаткиДенежныхСредствОбороты.СуммаОборот КАК СуммаПлатежа,
		|	ОстаткиДенежныхСредствОбороты.Валюта КАК Валюта,
		|	ОстаткиДенежныхСредствОбороты.Регистратор КАК Регистратор
		|ПОМЕСТИТЬ _ПрочиеОперацииПоРасчетномуСчету
		|ИЗ
		|	РегистрНакопления.ОстаткиДенежныхСредств.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Запись,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ОстаткиДенежныхСредствОбороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Оплата КАК Оплата
		|		ПО (Оплата.Ссылка = ОстаткиДенежныхСредствОбороты.Регистратор)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыСчетовДоверительногоУправленияУБрокеров.СрезПоследних(
		|				&ДатаФормирования,
		|				Организация = &Организация
		|					И СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КодБрокера
		|		ПО (КодБрокера.Брокер = ОстаткиДенежныхСредствОбороты.Брокер)
		|ГДЕ
		|	НЕ ТИПЗНАЧЕНИЯ(ОстаткиДенежныхСредствОбороты.Регистратор) В (ТИП(Документ.Сделка), ТИП(Документ.СделкаРЕПО), ТИП(Документ.ИсполнениеОбязательствПоСделке))
		|	И (ОстаткиДенежныхСредствОбороты.Регистратор.ВидЗадолженности ЕСТЬ NULL
		|			ИЛИ НЕ ОстаткиДенежныхСредствОбороты.Регистратор.ВидЗадолженности В (&ИсключенияИзПрочихОперацийПоРасчетномуСчету))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ПрочиеОперацииПоРасчетномуСчету.БанковскийСчет КАК БанковскийСчет,
		|	_ПрочиеОперацииПоРасчетномуСчету.ДатаПлатежа КАК ДатаПлатежа,
		|	_ПрочиеОперацииПоРасчетномуСчету.СодержаниеОперации КАК СодержаниеОперации,
		|	_ПрочиеОперацииПоРасчетномуСчету.СуммаПлатежа КАК СуммаПлатежа,
		|	_ПрочиеОперацииПоРасчетномуСчету.Валюта КАК Валюта
		|ИЗ
		|	_ПрочиеОперацииПоРасчетномуСчету КАК _ПрочиеОперацииПоРасчетномуСчету
		|
		|УПОРЯДОЧИТЬ ПО
		|	БанковскийСчет,
		|	ДатаПлатежа,
		|	СуммаПлатежа
		|ИТОГИ
		|	СУММА(СуммаПлатежа)
		|ПО
		|	ОБЩИЕ,
		|	БанковскийСчет
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	""Обнаружены операции с валютными ценными бумагами (%1)"" КАК ТекстОшибки,
		|	_Операции.Регистратор КАК Основание
		|ИЗ
		|	_Операции КАК _Операции
		|ГДЕ
		|	НЕ _Операции.Валюта В (&ВалютаУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""Обнаружены валютные комиссии за операции с ценными бумагами (%1)"",
		|	_Комиссии.Основание
		|ИЗ
		|	_Комиссии КАК _Комиссии
		|ГДЕ
		|	НЕ _Комиссии.Валюта В (&ВалютаУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""Обнаружены валютные операции по расчетному счету (%1)"",
		|	_ПрочиеОперацииПоРасчетномуСчету.Регистратор
		|ИЗ
		|	_ПрочиеОперацииПоРасчетномуСчету КАК _ПрочиеОперацииПоРасчетномуСчету
		|ГДЕ
		|	НЕ _ПрочиеОперацииПоРасчетномуСчету.Валюта В (&ВалютаУчета, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	""Обнаружены операции с корзиной ценных бумаг (%1)"",
		|	_Операции.ОснованиеКомиссии
		|ИЗ
		|	_Операции КАК _Операции
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ _Комиссии КАК _Комиссии
		|		ПО (_Комиссии.Основание = _Операции.ОснованиеКомиссии)
		|
		|СГРУППИРОВАТЬ ПО
		|	_Операции.ОснованиеКомиссии
		|
		|ИМЕЮЩИЕ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ _Операции.ЦеннаяБумага) > 1";
	
	#КонецОбласти	
	
	ДатаФормирования = ТекущаяДатаСеанса();
	
	ИсключенияИзПрочихОперацийПоРасчетномуСчету = Новый Массив;
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюКупона);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюКупона);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюОблигации);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоПоследнемуПогашениюОблигации);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюВекселя);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоПогашениюПая);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовАкции);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовДепозитарныеРасписки);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовИпотечныеСертификатыУчастия);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоНачислениюДивидендовПаи);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоТорговойКомиссии);
	ИсключенияИзПрочихОперацийПоРасчетномуСчету.Добавить(Справочники.ВидыЗадолженности.ПоБрокерскойКомиссии);
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("Организация",									ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления",					ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("НачалоПериода",									НачалоДня(ЭтотОбъект.Период.ДатаНачала));	
	Запрос.УстановитьПараметр("КонецПериода",									КонецДня(ЭтотОбъект.Период.ДатаОкончания));
	Запрос.УстановитьПараметр("КонецПериодаГраница",							Новый Граница(КонецДня(ЭтотОбъект.Период.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаФормирования",								ДатаФормирования);
	Запрос.УстановитьПараметр("ИсключенияИзПрочихОперацийПоРасчетномуСчету",	ИсключенияИзПрочихОперацийПоРасчетномуСчету);	
	Запрос.УстановитьПараметр("ВалютаУчета",									ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ВалютаУчета"));
	
	ПакетЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеШапки						= ПакетЗапроса[1].Выгрузить()[0];
	ОстаткиДенежныхСредствНаНачало	= ПакетЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОстаткиДенежныхСредствНаКонец	= ПакетЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ОперацииСЦеннымиБумагами		= ПакетЗапроса[10].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ПрочиеОперацииПоРасчетномуСчету	= ПакетЗапроса[12].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Ограничения						= ПакетЗапроса[13].Выбрать();

	// Проверим ограничения отчета
	
	Если Ограничения.Следующий() Тогда
		ВызватьИсключение СтрШаблон(Ограничения.ТекстОшибки, Ограничения.Основание);		
	КонецЕсли;
	
	// Шапка
	
	Макет = ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьШапка.Параметры.Заполнить(ДанныеШапки);
	ОбластьШапка.Параметры.ДатаФормирования			= Формат(ДатаФормирования, "ДЛФ=D");
	ОбластьШапка.Параметры.ПредставлениеПериода		= ПредставлениеПериода(ЭтотОбъект.Период.ДатаНачала, ЭтотОбъект.Период.ДатаОкончания, "ФП = Истина");
	ОбластьШапка.Параметры.ПредставлениеДоговора	= СтрШаблон("№ %1 от %2 года", ДанныеШапки.НомерДоговора, Формат(ДанныеШапки.ДатаЗаключения, "ДЛФ=D"));
	ОбластьШапка.Параметры.ЕдиницаИзмерения			= "руб.";
	
	ДокументРезультат.Вывести(ОбластьШапка);
	
	// Остатки д/с на начало
	
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
	ОбластьРаздел.Параметры.НаименованиеРаздела = "Денежные средства, переданные в доверительное управление на начало периода";
	ДокументРезультат.Вывести(ОбластьРаздел);
	
	ОбластьШапкаОстатковДС = Макет.ПолучитьОбласть("ШапкаОстатковДС");
	ДокументРезультат.Вывести(ОбластьШапкаОстатковДС);
	
	ОбластьИтогиОстатковДС = Макет.ПолучитьОбласть("ИтогиОстатковДС");
	
	Если ОстаткиДенежныхСредствНаНачало.Следующий() Тогда
		
		СтрокаОстатков = ОстаткиДенежныхСредствНаНачало.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока СтрокаОстатков.Следующий() Цикл
			
			ОбластьСтрокаОстатковДС = Макет.ПолучитьОбласть("СтрокаОстатковДС");
			ОбластьСтрокаОстатковДС.Параметры.Заполнить(СтрокаОстатков);
			ДокументРезультат.Вывести(ОбластьСтрокаОстатковДС);
				
			РасшифровкаСтроки = СтрокаОстатков.Выбрать();
			Пока РасшифровкаСтроки.Следующий() И ЗначениеЗаполнено(РасшифровкаСтроки.РасшифровкаСтроки) Цикл
				ОбластьРасшифровкаСтрокиОстатковДС = Макет.ПолучитьОбласть("РасшифровкаСтрокиОстатковДС");
				ОбластьРасшифровкаСтрокиОстатковДС.Параметры.Заполнить(РасшифровкаСтроки);
				ДокументРезультат.Вывести(ОбластьРасшифровкаСтрокиОстатковДС);
			КонецЦикла;
			
		КонецЦикла;
		
		ОбластьИтогиОстатковДС.Параметры.Заполнить(ОстаткиДенежныхСредствНаНачало);
	
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьИтогиОстатковДС);		
	
	// Операции с ц/б	
	
	ОбластьШапкаОперацииЦБ = Неопределено;
	
	ОбластьРазделительВидовЦБ	= Макет.ПолучитьОбласть("РазделительВидовЦБ");
	ОбластьИтогоПоВидуЦБ		= Неопределено;
	
	Пока ОперацииСЦеннымиБумагами.Следующий() Цикл
		
		Если ОбластьШапкаОперацииЦБ = Неопределено Тогда
			ОбластьШапкаОперацииЦБ = Макет.ПолучитьОбласть("ШапкаОперацииЦБ");
			ДокументРезультат.Вывести(ОбластьШапкаОперацииЦБ);
		КонецЕсли;
		
		Если ОбластьИтогоПоВидуЦБ <> Неопределено Тогда
			ДокументРезультат.Вывести(ОбластьРазделительВидовЦБ);
		КонецЕсли;
		
		НачатаГруппаСтрок = Ложь;
		
		ОперацияЦБ = ОперацииСЦеннымиБумагами.Выбрать();
		Пока ОперацияЦБ.Следующий() Цикл
			
			Если Не НачатаГруппаСтрок Тогда
				ДокументРезультат.НачатьГруппуСтрок();
				НачатаГруппаСтрок = Истина;
			КонецЕсли;
			
			ОбластьСтрокаОперацииЦБ = Макет.ПолучитьОбласть("СтрокаОперацииЦБ");
			ОбластьСтрокаОперацииЦБ.Параметры.Заполнить(ОперацияЦБ);
			ОбластьСтрокаОперацииЦБ.Параметры.ЦеннаяБумагаДатаРегистрации	= Формат(ОперацияЦБ.ЦеннаяБумагаДатаРегистрации, "ДФ=dd.MM.yy");
			ОбластьСтрокаОперацииЦБ.Параметры.ЦеннаяБумагаДатаПогашения		= Формат(ОперацияЦБ.ЦеннаяБумагаДатаПогашения, "ДФ=dd.MM.yy; ДП=-");
			ДокументРезультат.Вывести(ОбластьСтрокаОперацииЦБ);

		КонецЦикла;
		
		Если НачатаГруппаСтрок Тогда		
			ДокументРезультат.ЗакончитьГруппуСтрок();
		КонецЕсли;
		
		ОбластьИтогоПоВидуЦБ = Макет.ПолучитьОбласть("ИтогоПоВидуЦБ");
		ОбластьИтогоПоВидуЦБ.Параметры.Заполнить(ОперацииСЦеннымиБумагами);
		ДокументРезультат.Вывести(ОбластьИтогоПоВидуЦБ);
		
	КонецЦикла;
	
	// Прочие операции по расчетному счету	
	
	Если ПрочиеОперацииПоРасчетномуСчету.Следующий() Тогда
		
		ВыборкаРасчетныйСчет = ПрочиеОперацииПоРасчетномуСчету.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока ВыборкаРасчетныйСчет.Следующий() Цикл
			
			ОбластьРасчетныйСчет = Макет.ПолучитьОбласть("РасчетныйСчет");
			ОбластьРасчетныйСчет.Параметры.Заполнить(ВыборкаРасчетныйСчет);
			ДокументРезультат.Вывести(ОбластьРасчетныйСчет);
			
			ДокументРезультат.НачатьГруппуСтрок();
			
			Операция = ВыборкаРасчетныйСчет.Выбрать();
			Пока Операция.Следующий() Цикл
				ОбластьОперацияПоРасчетномуСчету = Макет.ПолучитьОбласть("ОперацияПоРасчетномуСчету");
				ОбластьОперацияПоРасчетномуСчету.Параметры.Заполнить(Операция);
				ДокументРезультат.Вывести(ОбластьОперацияПоРасчетномуСчету);
			КонецЦикла;
			
			ДокументРезультат.ЗакончитьГруппуСтрок();
			
		КонецЦикла;
		
		ОбластьИтогоПоРасчетномуСчету = Макет.ПолучитьОбласть("ИтогоПоРасчетномуСчету");
		ОбластьИтогоПоРасчетномуСчету.Параметры.Заполнить(ПрочиеОперацииПоРасчетномуСчету);
		ДокументРезультат.Вывести(ОбластьИтогоПоРасчетномуСчету);		
		
	КонецЕсли;
	
	// Остатки д/с на конец
	
	ОбластьРаздел = Макет.ПолучитьОбласть("Раздел");
	ОбластьРаздел.Параметры.НаименованиеРаздела = "Денежные средства, переданные в доверительное управление на конец периода";
	ДокументРезультат.Вывести(ОбластьРаздел);
	
	ОбластьШапкаОстатковДС = Макет.ПолучитьОбласть("ШапкаОстатковДС");
	ДокументРезультат.Вывести(ОбластьШапкаОстатковДС);
	
	ОбластьИтогиОстатковДС = Макет.ПолучитьОбласть("ИтогиОстатковДС");
	
	Если ОстаткиДенежныхСредствНаКонец.Следующий() Тогда
		
		СтрокаОстатков = ОстаткиДенежныхСредствНаКонец.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока СтрокаОстатков.Следующий() Цикл
			
			ОбластьСтрокаОстатковДС = Макет.ПолучитьОбласть("СтрокаОстатковДС");
			ОбластьСтрокаОстатковДС.Параметры.Заполнить(СтрокаОстатков);
			ДокументРезультат.Вывести(ОбластьСтрокаОстатковДС);
				
			РасшифровкаСтроки = СтрокаОстатков.Выбрать();
			Пока РасшифровкаСтроки.Следующий() И ЗначениеЗаполнено(РасшифровкаСтроки.РасшифровкаСтроки) Цикл
				ОбластьРасшифровкаСтрокиОстатковДС = Макет.ПолучитьОбласть("РасшифровкаСтрокиОстатковДС");
				ОбластьРасшифровкаСтрокиОстатковДС.Параметры.Заполнить(РасшифровкаСтроки);
				ДокументРезультат.Вывести(ОбластьРасшифровкаСтрокиОстатковДС);
			КонецЦикла;
			
		КонецЦикла;
		
		ОбластьИтогиОстатковДС.Параметры.Заполнить(ОстаткиДенежныхСредствНаКонец);
	
	КонецЕсли;
	
	ДокументРезультат.Вывести(ОбластьИтогиОстатковДС);	
	
	// Подвал
	
	ПараметрыВыводаПодписей			= Новый Структура;
	СтруктураДанныхКонтактногоЛица	= Неопределено;
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаРуководителя", СтруктураДанныхКонтактногоЛица);
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("Директор", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДиректорДолжность", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли;
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаБухгалтера", СтруктураДанныхКонтактногоЛица);
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("Бухгалтер", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("БухгалтерДолжность", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли;
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаИсполнителя", СтруктураДанныхКонтактногоЛица);
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("Исполнитель", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
	КонецЕсли;	
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаКлиентаРуководителя", СтруктураДанныхКонтактногоЛица);
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("КлиентДиректор", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("КлиентДиректорДолжность", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли;
	
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхПодписантаКлиентаБухгалтера", СтруктураДанныхКонтактногоЛица);
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("КлиентБухгалтер", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("КлиентБухгалтерДолжность", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли;
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьПодвал.Параметры.Заполнить(ДанныеШапки);
	ОбластьПодвал.Параметры.Заполнить(ПараметрыВыводаПодписей);
	ДокументРезультат.Вывести(ОбластьПодвал);
	
	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, Механизм);
		
	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры

#Область Автоматизация_формирования_отчета

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("ПодписантРуководитель");	
	Настройки.Добавить("ПодписантГлавбух");
	Настройки.Добавить("Подписант");
	
	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт

	ДополнительныеСвойства = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства;	
	
	// Заполняем настройки отчета	
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	Если НастройкиОтчета.Свойство("ПодписантРуководитель") Тогда 	
		ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаРуководителя", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(НастройкиОтчета.ПодписантРуководитель, ЭтотОбъект.Организация));
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("ПодписантГлавбух") Тогда 	
		ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаБухгалтера", РаботаСОтчетами.ПолучитьДанныеКонтактногоЛица(НастройкиОтчета.ПодписантГлавбух, ЭтотОбъект.Организация));
	КонецЕсли;
	
	Если НастройкиОтчета.Свойство("Подписант") Тогда 	
		ДополнительныеСвойства.Вставить("СтруктураДанныхПодписантаИсполнителя", НастройкиОтчета.Подписант);
	КонецЕсли;
	
	// Формируем отчет	
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

#КонецОбласти
